UrlClickEvents
| where IsClickedThrough == true
| join kind=inner (
    SigninLogs
    | where AuthenticationProtocol == "deviceCode"
    | where ResultType in ("0", "50074", "50076", "500121")
) on $left.AccountUpn == $right.UserPrincipalName
| project TimeGenerated, AccountUpn, IPAddress, AppDisplayName, ResourceDisplayName, Url, ResultType