let WhitelistedCurlCLI = "curl -fI https://download.mozilla.org/";
let base64_events = DeviceProcessEvents
| where Timestamp > ago(1d)
| where InitiatingProcessParentFileName in ("bash","zsh")
| where ProcessCommandLine contains "base64"
| project Timestamp_base64 = Timestamp, DeviceName, AccountName, CommandLine_base64 = ProcessCommandLine;
let curl_events = DeviceProcessEvents
| where Timestamp > ago(1d)
| where ProcessCommandLine contains "curl"
| where not(ProcessCommandLine has_any (WhitelistedCurlCLI)) 
| project Timestamp_curl = Timestamp, DeviceName, AccountName, CommandLine_curl = ProcessCommandLine;
base64_events
| join kind=inner (curl_events) on DeviceName, AccountName
| where Timestamp_curl > Timestamp_base64 and Timestamp_curl <= Timestamp_base64 + 10s
| project Timestamp_base64, Timestamp_curl, TimeDiff = Timestamp_curl - Timestamp_base64, DeviceName, AccountName, CommandLine_base64, CommandLine_curl
| extend Domain = extract(@"https?://([^/]+)", 1, CommandLine_curl)
| extend CurlUrl = extract(@"https?://[^\s]+", 0, CommandLine_curl)
| sort by Timestamp_base64 desc
| join kind=inner (
    DeviceNetworkEvents
    | where Timestamp > ago(1d)
    | where ActionType == "ConnectionSuccess"
    | project Timestamp = Timestamp, DeviceName, RemoteUrl, RemoteIP, RemotePort, ActionType, ReportId, DeviceId
    ) on DeviceName
| where RemoteUrl contains Domain
| where Timestamp >= Timestamp_curl
| where Timestamp_curl > Timestamp_base64
