Get-AppxPackage -Name MicrosoftCorporationII.QuickAssist | Remove-AppxPackage -AllUsers

DeviceNetworkEvents
| where InitiatingProcessCommandLine contains  "QuickAssist.exe"
| where RemoteUrl == "https://hub.relay.support.services.microsoft.com"


Disable Quick Assist

To disable Quick Assist, block traffic to the https://remoteassistance.support.services.microsoft.com endpoint. This is the primary endpoint used by Quick Assist to establish a session, and once blocked, Quick Assist can't be used to get help or help someone.

Note

Blocking the endpoint will disrupt the functionality of Remote Help, as it relies on this endpoint for operation.
Uninstall Quick Assist
Uninstall via PowerShell

Run the following PowerShell command as Administrator:

Get-AppxPackage -Name MicrosoftCorporationII.QuickAssist | Remove-AppxPackage -AllUsers
Uninstall via Windows Settings

Navigate to Settings > Apps > Installed apps > Quick Assist > select the ellipsis (…), then select Uninstall.
